###############################################################################
# Created by write_sdc
###############################################################################
current_design fir_filter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 13.0813 [get_ports {clk}]
set_clock_uncertainty 0.5000 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[0]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[10]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[11]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[12]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[13]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[14]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[15]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[1]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[2]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[3]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[4]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[5]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[6]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[7]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[8]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_in[9]}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_in[9]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sample_valid}]
set_input_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {sample_valid}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {ready}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {ready}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[0]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[0]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[10]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[10]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[11]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[11]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[12]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[12]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[13]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[13]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[14]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[14]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[15]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[15]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[1]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[1]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[2]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[2]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[3]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[3]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[4]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[4]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[5]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[5]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[6]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[6]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[7]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[7]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[8]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[8]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_out[9]}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_out[9]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {result_valid}]
set_output_delay 2.6163 -clock [get_clocks {clk}] -max -add_delay [get_ports {result_valid}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0500 [get_ports {ready}]
set_load -pin_load 0.0500 [get_ports {result_valid}]
set_load -pin_load 0.0500 [get_ports {result_out[15]}]
set_load -pin_load 0.0500 [get_ports {result_out[14]}]
set_load -pin_load 0.0500 [get_ports {result_out[13]}]
set_load -pin_load 0.0500 [get_ports {result_out[12]}]
set_load -pin_load 0.0500 [get_ports {result_out[11]}]
set_load -pin_load 0.0500 [get_ports {result_out[10]}]
set_load -pin_load 0.0500 [get_ports {result_out[9]}]
set_load -pin_load 0.0500 [get_ports {result_out[8]}]
set_load -pin_load 0.0500 [get_ports {result_out[7]}]
set_load -pin_load 0.0500 [get_ports {result_out[6]}]
set_load -pin_load 0.0500 [get_ports {result_out[5]}]
set_load -pin_load 0.0500 [get_ports {result_out[4]}]
set_load -pin_load 0.0500 [get_ports {result_out[3]}]
set_load -pin_load 0.0500 [get_ports {result_out[2]}]
set_load -pin_load 0.0500 [get_ports {result_out[1]}]
set_load -pin_load 0.0500 [get_ports {result_out[0]}]
set_input_transition 0.1500 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 16.0000 [current_design]
